{"summary":"I am an expert generalist with over 20 years of cross-functional software delivery experience, uniquely combining deep engineering skill with adaptive systems thinking. I excel in building and scaling platforms, particularly in the ERP space, and have a strong focus on leveraging AI to enhance product offerings. My career spans multiple domains, including FinTech, HealthTech, and AI, where I have consistently delivered impactful solutions by connecting technical depth with strategic execution.","skills":["Product Management","AI Integration","Microservices Architecture","Cloud Computing","DevOps","Cross-Functional Leadership","Agile Methodologies","Stakeholder Engagement","Data-Driven Decision Making","Compliance and Security","Systems Thinking","Technical Mentorship","Continuous Delivery","User-Centric Design","Distributed Systems","Observability"],"work_experience":[{"job_title":"Technical Lead","company":"dunnhumby","location":"London / Remote, UK","start_date":"Apr 2024","end_date":"Present","company_blurb":"dunnhumby is a global leader in customer data science, empowering retailers and consumer brands to make customer-first decisions at scale.","responsibilities":["Led architectural evolution and delivery for a leading data science platform in retail analytics.","Applied first principles and systems thinking to reshape engineering team workflows.","Architected and delivered a modular, event-driven backend using Rust and .NET.","Championed contract-driven development, reducing integration bugs and improving delivery confidence.","Established reusable Terraform module library and CI/CD templates."],"achievements":["Reduced cross-service integration bugs by 40%.","Accelerated delivery through improved architectural practices and team mentorship.","Contributed production code weekly in both Rust and C#."]},{"job_title":"Principal Software Engineer","company":"BrightInsight","location":"Remote","start_date":"Apr 2020","end_date":"Apr 2024","company_blurb":"BrightInsight is a leading global regulated digital health platform for biopharma and medtech.","responsibilities":["Led cross-functional development of regulated digital health platforms.","Orchestrated development of global health data platforms across AWS, Azure, and GCP.","Designed a unified Gherkin-based DSL for QA, enabling traceable test artefacts.","Created CI/CD pipelines with embedded DevSecOps gates.","Integrated early-stage LLMs to build predictive models for patient deterioration."],"achievements":["Improved detection rates by 25% through predictive model integration.","Standardised delivery across 8 global teams with shared test harnesses."]},{"job_title":"Technical Director","company":"Baby Point App Ltd","location":"London / Remote","start_date":"Jan 2019","end_date":"Apr 2020","company_blurb":"Baby Point App Ltd built a geolocation-based discovery app for new and expectant parents.","responsibilities":["Led product and platform development for an offline-first mobile app.","Architected a geohash-based REST API for region-specific content delivery.","Developed a SQLite-backed spatial search engine for mobile devices.","Supported rapid MVP cycles through lean product development."],"achievements":["Achieved 10K organic users in under 6 months."]}],"early_career":[{"title":"Principal Solution Architect","company":"Philips","dates":"Jan 2019 – Apr 2020"},{"title":"Lead Mobile Developer","company":"Investec Bank Plc","dates":"Feb 2017 – Mar 2017"},{"title":"Lead Consultant","company":"ThoughtWorks Ltd","dates":"Feb 2015 – Feb 2017"},{"title":"Mobile Tech Lead","company":"Ernst & Young (EY)","dates":"Sep 2014 – Feb 2015"}]}